// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "送給我",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "最重要的水呱呱",  // 同上...
        "今天是你的生日",
        "我們相識也超過一年了",
        "以後還會一起過更多生日",
        "一起玩更多的遊戲",
        "留下更多開心的回憶",
        "要好好吃好好睡健健康康的喔!",
        "要把可愛的呱呱長得頭好壯壯",
        "然後抱走",
        "嘿嘿~~",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "最重要的水呱呱": "./imgs/image.png",
        "今天是你的生日": "./imgs/image1.png",
        "我們相識也超過一年了": "./imgs/image2.png",
        "以後還會一起過更多生日": "./imgs/image3.png",
        "一起玩更多的遊戲": "./imgs/image4.png",
        "留下更多開心的回憶": "./imgs/image5.png",
        "要好好吃好好睡健健康康的喔!": "./imgs/image6.png",
        "要把可愛的呱呱長得頭好壯壯": "./imgs/image7.png",
        "然後抱走": "./imgs/image8.png",
        "嘿嘿~~": "./imgs/image9.png",
        // "今天是你的生日": "./imgs/birthday.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "點點我",
        play: "音樂",
        bannar_coming: "彩帶",
        balloons_flying: "好像少了點東西",
        cake_fadein: "蛋糕？",
        light_candle: "蠟燭？",
        wish_message: "生日快樂",
        story: "A MESSAGE FOR YOU",
    }
};
